Repository: parice02/fasoarzeka
Catalog: fasoarzeka/locales/*/LC_MESSAGES/arzeka.po
Languages: fr

source: Authentication token is not set. Please authenticate first.
fr: Le jeton d'authentification n'est pas défini. Veuillez vous authentifier d'abord.

source: Request timeout after %(timeout)s seconds
fr: Délai d'attente écoulé après %(timeout)s secondes

source: Failed to connect to Arzeka API: %(err)s
fr: Échec de la connexion à l'API Arzeka : %(err)s

source: API request failed: %(err)s
fr: La requête API a échoué : %(err)s

source: Unexpected error: %(err)s
fr: Erreur inattendue : %(err)s

source: Automatic re-authentication failed: %(err)s
fr: La ré-authentification automatique a échoué : %(err)s

source: username must be a non-empty string
fr: Le nom d'utilisateur doit être une chaîne non vide

source: password must be a non-empty string
fr: Le mot de passe doit être une chaîne non vide

source: Invalid response format from authentication endpoint
fr: Format de réponse invalide depuis le point d'authentification

source: Authentication response missing required fields
fr: La réponse d'authentification ne contient pas les champs requis

source: Invalid credentials: username or password is incorrect
fr: Identifiants invalides : le nom d'utilisateur ou le mot de passe est incorrect

source: Access forbidden: account may be locked or inactive
fr: Accès interdit : le compte peut être bloqué ou inactif

source: Authentication request failed: %(err)s
fr: La requête d'authentification a échoué : %(err)s

source: Failed to connect to authentication endpoint: %(err)s
fr: Échec de la connexion au point d'authentification : %(err)s

source: Authentication request timeout after %(timeout)s seconds
fr: Délai d'attente de la requête d'authentification après %(timeout)s secondes

source: Authentication failed with unexpected error: %(err)s
fr: L'authentification a échoué avec une erreur inattendue : %(err)s

source: amount must be a positive number greater than %(min)s
fr: Le montant doit être un nombre positif supérieur à %(min)s

source: merchant_id must be a non-empty string/int
fr: merchant_id doit être une chaîne ou un entier non vide

source: additional_info must contain firstname, lastname, and mobile
fr: additional_info doit contenir firstname, lastname et mobile

source: When generateReceipt is True, additional_info must contain: %(fields)s
fr: Lorsque generateReceipt est True, additional_info doit contenir : %(fields)s

source: additional_info fields firstname, lastname, and mobile cannot be empty or null
fr: Les champs additional_info firstname, lastname et mobile ne peuvent pas être vides ou nuls

source: mapped_order_id must be a non-empty string
fr: mapped_order_id doit être une chaîne non vide

source: Not authenticated. Please call authenticate() first.
fr: Non authentifié. Veuillez appeler authenticate() d'abord.
